<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <link rel="stylesheet" href="https://stackpath.bootstrapcdn.com/bootstrap/4.5.0/css/bootstrap.min.css" integrity="sha384-9aIt2nRpC12Uk9gS9baDl411NQApFmC26EwAOH8WgZl5MYYxFfc+NcPb1dKGj7Sk" crossorigin="anonymous">
    <link rel="stylesheet" href="style.css">
    <title>VolgaCars</title>
</head>

<body>
    <div class="row">
        <div class="col">
            <nav class="navbar navbar-expand-lg navbar-dark bg-dark fixed-top ">
                <button class="navbar-toggler  justify-content-around" type="button" data-toggle="collapse" data-target="#navbarNavAltMarkup" aria-controls="navbarNavAltMarkup" aria-expanded="false" aria-label="Toggle navigation">
                    <span class="navbar-toggler-icon"></span>
                </button>
                <div class="collapse navbar-collapse justify-content-around " id="navbarNavAltMarkup">
                    <div class="navbar-nav">
                        <a class="nav-item nav-link" href="index.php">Фирмы</a>
                        <a class="nav-item nav-link active" href="spisok_auto.php">Список автомобилей</a>
                        <a class="nav-item nav-link" href="contacts.php">Контакты</a>
                        <a class="nav-item nav-link" href="registration.php">Регистрация</a>
                    </div>
                </div>
            </nav>
        </div>
    </div>

    <main>
        <?php require 'filter.php';
        echo wordfilter('Пожалуйста сука работай я тебя блять умоляю нахуй')?>

        <div class="container content">
            <h1><a name="BMW">BMW</a></h1>
            <div class="row">
                <div class="col-3">
                    <img src="img/X6.png" alt="X6">
                </div>
                <div class="col-9">
                    <p>BMW X6 (заводское обозначение E71) — полноприводный кроссовер класса E. Концепт, оснащенный гибридной силовой установкой ActiveHybrid, был представлен в 2007 году на автосалоне во Франкфурте. Силовой агрегат концепта был разработан баварским концерном в сотрудничестве с DaimlerChrysler и General Motors, он состоит из бензинового мотора и двух высокоэффективных электродвигателей. Автомобиль может использовать только электромоторы, только ДВС или оба источника сразу. Дополняла силовую установку двухрежимная автоматическая трансмиссия, позволяющая адаптировать работу двигателей под движение на низкой или высокой скорости.
                        В максимальной комплектации xDrive50i на автомобиль установлен 4,4-литровый V8 с двойным турбонаддувом и мощностью 407 л.с. при 5500 об/мин. Такой двигатель может разогнать X6 до 100 км/ч за 5,4 сек., а максимальная скорость ограничена электроникой на отметке 250 км/ч. Комплектация xDrive35i предлагает двигатель V6 объемом 3,0 литра мощностью 306 л.с. при 5800 об/мин. Разгон до 100 км/ч составляет 6,7 секунд, а максимальная скорость 240 км/ч. Средний расход топлива — 10,9 л на 100 км.</p>
                </div>
            </div>
            <div class="row">
                <div class="col-3"><img src="img/M8.png" alt="">
                </div>
                <div class="col-9">
                    <p>Новый БМВ М8 2020 модельного года является воплощением мощи, элегантности и отменной аэродинамики. Большинство внешних кузовных панелей «эмки» позаимствовали у базовых «восьмерок», однако без оригинальных компонентов, разумеется, дело не обошлось. Снаружи представители семейства M8 легко распознаются по особым бамперам, иным зеркалам заднего вида оптимизированной формы, более крупным «жабрам» за передними колесными арками и спойлеру на крышке багажника. Сзади у самых «злых» вариаций BMW 8 серии торчат четыре сгруппированных попарно круглых патрубка выпускной системы диаметром 100 мм. Выхлопная система, к слову, снабжена специальным электрически управляемым клапаном, с помощью которого можно изменять звук работы двигателя (кнопка M Sound Control).
                        В части техники двухдверки BMW M8 Coupe и BMW M8 Convertible максимально близки к седану BMW M5, а BMW M8 Competition Coupe и BMW M8 Competition Convertible – к топ-версии BMW M5 Competition. Это означает, что все четыре разновидности «эмки» получают двигатель V8 4.4 M TwinPower Turbo, 8-ступенчатый «автомат» M Steptronic и полный привод M xDrive, позволяющий в режиме 2WD передавать тягу исключительно на заднюю ось. Отдача мотора у базовых купе и кабриолета БМВ М8 составляет 600 л.с. и 750 Нм, у модификаций Competition мощность повышена до 625 л.с. (момент остается таким же).</p>
                </div>
            </div>
            <div class="row">
                <div class="col-3"><img src="img/X5.png" alt=""></div>
                <div class="col-9">
                    <p>BMW X5 — первый блять за  всю многолетнюю историю компании BMW полноценный внедорожник. Благодаря внушительному дорожному просвету, постоянному полному приводу и независимой подвеске всех колес, автомобиль рассчитан на вождение по дорогам всех типов. Дебют состоялся в январе 1999 года на автосалоне в Детройте. На европейский рынок поступил весной 2000 года.
                        В основе BMW X5 лежит абсолютно новая платформа. В отличие от классических внедорожников этот имеет несущий кузов. Дизайн получился ярким и респектабельным. Задняя дверь — двустворчатая. Размещение запасного колеса сзади не предусмотрено. Объем багажника велик, да и сама конфигурация багажного отсека не позволяет перевозить крупногабаритные предметы.
                        BMW X5 оснащается полностью алюминиевым мотором V8 объемом 4,4 литра мощностью 286 л.с. Он способен разогнать автомобиль до скорости 100 км/ч всего за 7,5 секунды. Причем, благодаря фирменной системе изменения фаз газораспределения Double Vanos, мотор практически во всем диапазоне оборотов работает с почти максимальной отдачей. Силовой агрегат трудится в паре с гидромеханической 5-ступенчатой коробкой передач Steptronic.</p>
                </div>
            </div>
            <h1><a name="VAZ">LADA</a></h1>
            <div class="row">
                <div class="col-3">
                    <img src="img/vedro.png" alt="X6">
                </div>
                <div class="col-9">
                    <p>Долгожданная новинка блять российского сегмента бюджетных автомобилей – седан Лада Веста – по своим габаритным размерам находится на границе B и C классов. Длина автомобиля составляет 4410 мм, ширина – 1764 мм, высота – 1497 мм, колесная база – 2635 мм. Просвет под днищем в 178 мм позволяет уверенно передвигаться по дорогам с плохим покрытием, будь то испещренный ямами асфальт или загородная грунтовка. Помимо большого клиренса хорошую геометрическую проходимость обеспечивают достаточно короткие свесы: передний – 860 мм, задний – 915 мм.

                        Линейка двигателей Lada Vesta включает несколько бензиновых силовых установок. Со старта продаж автомобиль предлагается только с 1.6-литровым мотором мощностью 106 л.с. Этот четырехцилиндровый агрегат с заводским номером 21129 является российской разработкой и устанавливается на другие модели АвтоВАЗа, например, на ту же Лада Гранта лифтбек. Позже моторная гамма седана пополнится двигателями H4M (1.6 литра, 110 л.с.) и 21179 (1.8 литра, 122 л.с.) Первый мотор предоставлен альянсом Renault-Nissan, второй – отечественной разработки.</p>
                </div>
            </div>
            <div class="row">
                <div class="col-3">
                    <img src="img/korch.png" alt="X6">
                </div>
                <div class="col-9">
                    <p>ВАЗ 2107 выпускалась Употреблять с марта 1982 по апрель 2012.
                        В Египте выпускается с 2006 года и по сей день.

                        Имеет 5-ти местный кузов типа седан, рядные бензиновые 4-цилиндровые двигатели, в паре с 4-х или 5-ти ступенчатой механической КПП.
                        Входит в класс субкомпактных автомобилей, по европейской классификации — класс "B". И никакой не С, как говорят на форумах. С класс — это Ford Focus, KIA Ceed и т.д.
                        Колесная формула 4х2, привод на задние колёса.
                        Прародителем является итальянский Fiat 124.
                        Общие параметры ВАЗ 2107

                        Длина — 4145 мм
                        Ширина — 1620 мм
                        Высота — 1446 мм
                        База — 2424 мм
                        Колея передних колёс — 1365 мм
                        Колея задних колёс — 1321 мм
                        Клиренс (дорожный просвет) — до поперечины передней подвески — 159 мм, до балки заднего моста — 154, до корпуса глушителя — 120 мм.
                        Неплохо, например у Опель Зафира, всего 150 мм до самой верхней точки.
                        Грузоподъёмность — 400 кг
                        Объём багажника — 385 литров
                        Собственная масса — 1060 кг
                        Полная масса — 1460 кг
                        Масса буксируемого прицепа, без тормозов — 300 кг, с тормозами — 600 кг.

                        Двигатели ВАЗ 2107

                        ВАЗ 2107 комплектовался несколькими двигателями (для России и СССР), это:

                        двигатель ВАЗ 2103 (8-ми кл., 1500 см3, 71 л.с., карбюратор)
                        двигатель ВАЗ 2105 (8-ми кл., 1300 см3, 64 л.с., карбюратор, ременной привод ГРМ)
                        двигатель ВАЗ 2106 (8-ми кл., 1600 см3, 79 л.с., карбюратор)
                        двигатель ВАЗ 2104 (8-ми кл., 1500 см5, 68 л.с., центральный впрыск)
                        двигатель ВАЗ 21067 (8-ми кл., 1600 см3, 74 л.с., распределённый впрыск)
                        двигатель РПД (роторный, 1300 см3, 140 л.с.)</p>
                </div>
            </div>
            <div class="row">
                <div class="col-3">
                    <img src="img/net.png" alt="X6">
                </div>
                <div class="col-9">
                    <p>Lada Granta, он же ВАЗ-2190 — это бюджетный седан, созданный на базе Kalina образца 2004 года. Автомобили имеют одинаковую ходовую часть, некоторые механические узлы, одинаковый каркас кузова и оформление салона. По сравнению с Калиной, у Гранты, больше размер багажника, дизайн передней и задней частей кузова заметно изменен, также Granta получила новые осветительные приборы. Название модели появилось с помощью проведенного всероссийского конкурса на новое название для новинки завода.
                        Комплектации три: «стандарт», «норма» и «люкс». Базовая версия оснащается одной подушкой безопасности и 1,6-литровым восьмиклапанным мотором мощностью 80 л.с. Комплектация «Норма» имеет в списке оснащения электроусилитель руля, передние электростеклоподъемники, центральный замок, бортовой компьютер и бамперы, окрашенные в цвет кузова. Под капотом этой версии 1,6-литровый мотор с облегченной шатунно-поршневой группой мощностью 90 л.с. В комплектации «Люкс» на автомобиль устанавливают 16-клапанный двигатель 1,6 литра мощностью 98 л. с. Данна комплектация дополнена второй подушкой безопасности, АБС, кондиционером, аудиосистемой, подогревом передних сидений, зеркалами с электроприводом и обогревом, задними электростеклоподъемниками, легкосплавными дисками.</p>
                </div>
            </div>
            <h1><a name="merin">Mercedes-Benz</a></h1>
            <div class="row">
                <div class="col-3">
                    <img src="img/g63.png" alt="X6">
                </div>
                <div class="col-9">
                    <p>Mercedes g63 amg. В России работает особое отношение к AMG 63, считается, что на подобном автомобиле передвигаются сильные мира сего, которые способны решать любые вопросы, с обеих сторон закона. Что же манит автолюбителей к подобным автомобилям, неужели только квадратные формы? Есть Ниссан Куб, с квадратными формами, однако очередь из бородатых брутальных мужчин не выстраивается за этой японской малолитражкой.
                        Этот момент интересует покупателей больше всего, хотя не все собираются выжимать из потенциала внедорожника максимум. Машине полагается 4-литровый V8 M177, устанавливаемый всем AMG моделям бренда.
                        Двигатель выдает 585 лошадиных сил и 850 H*m крутящего момента за счет пары турбин. В пару идет 9-ступенчатый автомат Speedshift TCT 9G, которая через систему 4Matic блокирует межосевую муфту, распределяя мощность по колесам. Остались блокировки межколесных дифференциалов, что способствует управляемости и конечно проходимости.</p>
                </div>
            </div>
            <div class="row">
                <div class="col-3">
                    <img src="img/pontorezka.png" alt="X6">
                </div>
                <div class="col-9">
                    <p>Mercedes W140 – самый легендарный автомобиль за всю историю концерна Daimler. Фанатов у него огромное количество, о нем мечтали, ведь он был главным символом богатства и его любили. Его считают эталоном и даже лучше новых поколений, фраза «Мерседес уже не тот» связана с «Рубль сорок». Был он кстати не самым продаваемым, несмотря на общую любовь, продано в два раза меньше, чем предшественника W126.
                        Общие данные:
                        Тип кузова 4-дверный седан седан с удл. базой 2-дверное купе
                        Объем багажника, л 525 (седаны) 505
                        Объем бака, л 100
                        Трансмиссия
                        Тип привода задний
                        КПП 5-ст. механ., 4– или 5-ст. автом.
                        Ходовая часть:
                        Тормоза передние/задние диск./диск
                        Подвеска передняя/задняя незав./незав.
                        Шины 235/60 R16, 255/45 R18
                        Двигатели:
                        Бенз. 6-цилиндровые 2,8 л (193 л.с.) 24V, , 3,2 л (231 л.с.) 24V
                        8-цилиндровые 4,2 л (279 л.с.) 32V, 5,0 л (320 л.с.) 32V
                        12-цилиндровый 6,0 л (394 л.с.) 48V
                        Турбодизельные 6-цилиндровые 3,0 л (177 л.с.) 24V, 3,5 л (150 л.с.)</p>
                </div>
            </div>
            <div class="row">
                <div class="col-3">
                    <img src="img/AMG.png" alt="X6">
                </div>
                <div class="col-9">
                    <p>Mercedes-Benz AMG GT. A.M.G.- подразделение базирующегося в Штутгарте автопроизводителя. С 2007 года суббренд был полностью поглощён автогигантом, что с одной стороны позволило расширить его возможности по подготовке автомобилей, но с другой, значительно уменьшило его самостоятельность в принятии решений. Самое интересное в данном автомобиле это конечно же мотор. Покупатель может выбрать автомобиль с одним из 2-х моторов, которые разрабатывала сама компания Mercedes-Benz.
                        Оба мотора битурбированные и имеют объем по 4 литра. Это V-образные двигателя V8. Первый двигатель выдает 462 лошади, а второй 510 лошадиных сил. Пару систем этих моторов было взято от Mercedes-Benz SLS AMG.
                        Двигатель, который более слабее развивает сто километров в час ровно за 4 секунды, а второй за 3,8 секунды. С первым мотором автомобиль может разогнаться максимум до 304 км/ч, а со вторым до 310 км/ч.</p>
                </div>
            </div>
        </div>
    </main>



    <footer class="footer sticky-bottom ">
        <div class="container ">
            <div class="row">
                <div class="col-3">
                    <h5>Страницы</h5>
                    <ul>
                        <li><a class="nav-item nav-link active" href="index.php">Фирмы</a>
                        <li>
                            <a class="nav-item nav-link" href="spisok%20auto.html">Список автомобилей</a>
                        </li>
                        <li>
                            <a class="nav-item nav-link" href="contacts.php">Контакты</a>
                        </li>
                    </ul>
                </div>
                <div class="col-6 d-flex justify-content-center">
                    <div class="ya-share2 st" data-services="vkontakte,facebook,twitter,reddit,telegram"></div>
                </div>
                <div class="col-3 d-flex justify-content-around">
                    <div class="row">COPYRIGHT.2020&copy;</div>
                </div>
            </div>
        </div>
    </footer>





    <script src="https://yastatic.net/es5-shims/0.0.2/es5-shims.min.js"></script>
    <script src="https://yastatic.net/share2/share.js"></script>

    <script src="https://code.jquery.com/jquery-3.5.1.slim.min.js" integrity="sha384-DfXdz2htPH0lsSSs5nCTpuj/zy4C+OGpamoFVy38MVBnE+IbbVYUew+OrCXaRkfj" crossorigin="anonymous"></script>
    <script src="https://cdn.jsdelivr.net/npm/popper.js@1.16.0/dist/umd/popper.min.js" integrity="sha384-Q6E9RHvbIyZFJoft+2mJbHaEWldlvI9IOYy5n3zV9zzTtmI3UksdQRVvoxMfooAo" crossorigin="anonymous"></script>
    <script src="https://stackpath.bootstrapcdn.com/bootstrap/4.5.0/js/bootstrap.min.js" integrity="sha384-OgVRvuATP1z7JjHLkuOU7Xw704+h835Lr+6QL9UvYjZE3Ipu6Tp75j7Bh/kR0JKI" crossorigin="anonymous"></script>
</body></html>
