<?php

return [

    'obscene_patterns' => [
        '/(\s|^|рас|раз|под|о|при)(ху(й|ю|и|я|е|л(и|е)))/',
        '/(\s|^|)(пид(о|а|e)р)/',
        '/(\s|^|)(еблан)/',
        '/(\s|^|)(гандон)/',
        '/(\s|^|^истр(е|и))(бля(дь)*)/',
        '/(\s|^|^[закол]|разъ|за|отъ|вы)(еб(ать|ал|и|н|уч(ая|ий))*)/',
        '/(\s|^|)(муд(е|ил|о|а|я|ло|еб))/',
        '/(\s|^|)(пизд(а|ец|юк|y))/',
        '/(\s|^|от)(сос(и|ать))/',
        '/(\s|^)(пизд(а|у|ы|ец|и))/',
        '/д(е|и)би(л|лы)/',
        '/(е|ё|йо)пта/',
        '/проебина/',
        '/педераст/',
        '/у(е|ё)бок/',
        '/уебан/',
        '/пидрил/',
        '/антверпен/',
        '/антарктида/'
    ],


    'replace_pattern' => '***',

];